tirth-pandya/son_of_a_gun_game/projects/lpc40xx_freertos/l5_application/led_display_driver.c
#include "led_display_driver.h"
#include "delay.h"
#include "gpio.h"
#include "lpc40xx.h"
#include "pwm1.h"

gpio_s u_red;
gpio_s u_blue;
gpio_s u_green;

gpio_s l_red;
gpio_s l_blue;
gpio_s l_green;

gpio_s latch;
gpio_s clk;

gpio_s addr_a;
gpio_s addr_b;
gpio_s addr_c;
gpio_s addr_d;
gpio_s addr_e;

gpio_s oe;

void led_display_init() {
  addr_a = gpio__construct_as_output(GPIO__PORT_1, 20);
  addr_b = gpio__construct_as_output(GPIO__PORT_1, 23);
  addr_c = gpio__construct_as_output(GPIO__PORT_1, 28);
  addr_d = gpio__construct_as_output(GPIO__PORT_1, 29);
  addr_e = gpio__construct_as_output(GPIO__PORT_1, 30);

  oe = gpio__construct_as_output(GPIO__PORT_2, 2);
  clk = gpio__construct_as_output(GPIO__PORT_2, 0);
  latch = gpio__construct_as_output(GPIO__PORT_2, 1);
  u_red = gpio__construct_as_output(GPIO__PORT_0, 6);
  u_green = gpio__construct_as_output(GPIO__PORT_0, 7);
  u_blue = gpio__construct_as_output(GPIO__PORT_0, 8);

  l_red = gpio__construct_as_output(GPIO__PORT_0, 26);
  l_green = gpio__construct_as_output(GPIO__PORT_0, 25);
  l_blue = gpio__construct_as_output(GPIO__PORT_1, 31);

  gpio__reset(addr_a);
}

void led_display_clk() {
  gpio__set(clk);
  gpio__reset(clk);
}

void led_display_latch(uint8_t sig) {
  if (sig == 0) {
    gpio__reset(latch);
    gpio__reset(oe);
    delay__us(1);
  } else {
    gpio__set(latch);
    gpio__set(oe);
    delay__us(1);
  }
}

void led_display_set_addr(uint8_t row) {

  if (row & 1) {
    gpio__reset(addr_a);
  } else {
    gpio__set(addr_a);
  }
  if ((row & (1 << 1))) {
    gpio__reset(addr_b);
  } else {
    gpio__set(addr_b);
  }
  if ((row & (1 << 2))) {
    gpio__reset(addr_c);
  } else {
    gpio__set(addr_c);
  }
  if ((row & (1 << 3))) {
    gpio__reset(addr_d);
  } else {
    gpio__set(addr_d);
  }
  /*
  if ((row & (1 << 4))) {
    gpio__reset(addr_e);
  } else {
    gpio__set(addr_e);
  }*/
}

void led_display_draw_frame() {

  uint8_t offset = 16;
  uint64_t b;

  for (int i = 0; i < 16; i++) {

    led_display_set_addr(i - 1);
    // led_display_set_addr(i);
    gpio__reset(latch);
    gpio__reset(oe);

    for (int8_t a = 31; a >= 0; a--) {
      // for (int8_t a = 0; a < 64; a++) {
      b = 0;
      b = 1 << (a);
      if (led_board_red[i + 64] & b)
        gpio__set(l_red);
      else
        gpio__reset(l_red);

      if (led_board_red[i + offset + 64] & b)
        gpio__set(u_red);
      else
        gpio__reset(u_red);

      if (led_board_green[i + 64] & b)
        gpio__set(l_green);
      else
        gpio__reset(l_green);

      if (led_board_green[i + offset + 64] & (b))
        gpio__set(u_green);
      else
        gpio__reset(u_green);

      if (led_board_blue[i + 64] & b)
        gpio__set(l_blue);
      else
        gpio__reset(l_blue);

      if (led_board_blue[i + offset + 64] & b)
        gpio__set(u_blue);
      else
        gpio__reset(u_blue);

      led_display_clk();
    }

    for (int8_t a = 31; a >= 0; a--) {
      // for (int8_t a = 0; a < 64; a++) {
      b = 0;
      b = 1 << (a);
      if (led_board_red[i] & b)
        gpio__set(l_red);
      else
        gpio__reset(l_red);

      if (led_board_red[i + offset] & b)
        gpio__set(u_red);
      else
        gpio__reset(u_red);

      if (led_board_green[i] & b)
        gpio__set(l_green);
      else
        gpio__reset(l_green);

      if (led_board_green[i + offset] & (b))
        gpio__set(u_green);
      else
        gpio__reset(u_green);

      if (led_board_blue[i] & b)
        gpio__set(l_blue);
      else
        gpio__reset(l_blue);

      if (led_board_blue[i + offset] & b)
        gpio__set(u_blue);
      else
        gpio__reset(u_blue);

      led_display_clk();
    }

    gpio__set(latch);
    gpio__set(oe);
  }
  delay__us(250);
}

void game_draw_display() {

  for (int i = 0; i < 128; i++) {
    led_board_blue[i] = 0;
    led_board_red[i] = 0;
    led_board_green[i] = 0;
  }

  led_board_green[31] = 0b11111111111111111111111111111111;
  led_board_green[30] = 0b11111111111111111111111111111110;
  led_board_green[29] = 0b11111111111111111111111111111100;
  led_board_green[28] = 0b11111111111111111111111111111000;
  led_board_green[27] = 0b11111111111111111111111111110000;
  led_board_green[26] = 0b11111111111111111111111111100000;
  led_board_green[25] = 0b11111111111111111111111111000000;
  led_board_green[24] = 0b11111111111111111111111110000000;
  led_board_green[23] = 0b11111111111111111111111100000000;
  led_board_green[22] = 0b11111111111111111111111000000000;
  led_board_green[21] = 0b11111111111111111111110000000000;

  led_board_red[21] = 0b11111111111111111111110000000000;
  led_board_blue[21] = 0b11111111111111111111110000000000;

  led_board_red[20] = 0b11111111111111111111100000000000;
  led_board_red[19] = 0b11111111111111111111000000000000;
  led_board_red[18] = 0b11111111111111111110000000000000;
  led_board_red[17] = 0b11111111111111111100000000000000;
  led_board_red[16] = 0b11111111111111111000000000000000;
  led_board_red[15] = 0b11111111111111110000000000000000;
  led_board_red[14] = 0b11111111111111100000000000000000;
  led_board_red[13] = 0b11111111111111000000000000000000;
  led_board_red[12] = 0b11111111111110000000000000000000;
  led_board_red[11] = 0b11111111111100000000000000000000;
  led_board_red[10] = 0b11111111111000000000000000000000;

  led_board_blue[9] = 0b11111111110000000000000000000000;
  led_board_blue[8] = 0b11111111100000000000000000000000;
  led_board_blue[7] = 0b11111111000000000000000000000000;
  led_board_blue[6] = 0b11111110000000000000000000000000;
  led_board_blue[5] = 0b11111100000000000000000000000000;
  led_board_blue[4] = 0b11111000000000000000000000000000;
  led_board_blue[3] = 0b11110000000000000000000000000000;
  led_board_blue[2] = 0b11100000000000000000000000000000;
  led_board_blue[1] = 0b11000000000000000000000000000000;
  led_board_blue[0] = 0b10000000000000000000000000000000;
  /*
    led_board_green[31] = 0b11111111111111111111111111111111;
    led_board_green[30] = 0b11111111111111111111111111111111;
    led_board_green[29] = 0b11111111111111111111111111111111;
    led_board_green[28] = 0b11111111111111111111111111111111;

    led_board_green[27] = 0b11111111111111111111111111111111;
    led_board_green[26] = 0b11111111111111111111111111111111;
    led_board_green[25] = 0b11111111111111111111111111111111;
    led_board_green[24] = 0b11111111111111111111111111111111;
    led_board_green[23] = 0b11111111111111111111111111111111;
    led_board_green[22] = 0b11111111111111111111111111111111;
    led_board_green[21] = 0b11111111111111111111111111111111;

    led_board_red[23] = 0b11111111111111111111111111111111;
    led_board_red[22] = 0b11111111111111111111111111111111;
    led_board_red[21] = 0b11111111111111111111111111111111;

    led_board_blue[27] = 0b11111111111111111111111111111111;
    led_board_blue[26] = 0b11111111111111111111111111111111;
    led_board_blue[25] = 0b11111111111111111111111111111111;
    led_board_blue[24] = 0b11111111111111111111111111111111;
    led_board_blue[23] = 0b11111111111111111111111111111111;
    led_board_blue[22] = 0b11111111111111111111111111111111;
    led_board_blue[21] = 0b11111111111111111111111111111111;

    led_board_red[20] = 0b11111111111111111111111111111111;
    led_board_red[19] = 0b11111111111111111111111111111111;
    led_board_red[18] = 0b11111111111111111111111111111111;
    led_board_red[17] = 0b11111111111111111111111111111111;
    led_board_red[16] = 0b11111111111111111111111111111111;
    led_board_red[15] = 0b11111111111111111111111111111111;

    led_board_green[20] = 0b11111111111111111111111111111111;
    led_board_green[19] = 0b11111111111111111111111111111111;
    led_board_green[18] = 0b11111111111111111111111111111111;
    led_board_green[17] = 0b11111111111111111111111111111111;
    led_board_green[16] = 0b11111111111111111111111111111111;
    led_board_green[15] = 0b11111111111111111111111111111111;

    led_board_red[14] = 0b11111111111111111111111111111111;
    led_board_red[13] = 0b11111111111111111111111111111111;
    led_board_red[12] = 0b11111111111111111111111111111111;
    led_board_red[11] = 0b11111111111111111111111111111111;
    led_board_red[10] = 0b11111111111111111111111111111111;

