tirth-pandya/son_of_a_gun_game/projects/lpc40xx_freertos/l5_application/led_display_driver.c
    led_board_blue[9] = 0b11111111111111111111111111111111;
    led_board_blue[8] = 0b11111111111111111111111111111111;
    led_board_blue[7] = 0b11111111111111111111111111111111;
    led_board_blue[6] = 0b11111111111111111111111111111111;

    led_board_green[9] = 0b11111111111111111111111111111111;
    led_board_green[8] = 0b11111111111111111111111111111111;
    led_board_green[7] = 0b11111111111111111111111111111111;
    led_board_green[6] = 0b11111111111111111111111111111111;

    led_board_red[5] = 0b11111111111111111111111111111111;
    led_board_red[4] = 0b11111111111111111111111111111111;
    led_board_red[3] = 0b11111111111111111111111111111111;

    led_board_blue[5] = 0b11111111111111111111111111111111;
    led_board_blue[4] = 0b11111111111111111111111111111111;
    led_board_blue[3] = 0b11111111111111111111111111111111;

    led_board_blue[2] = 0b11111111111111111111111111111111;
    led_board_blue[1] = 0b11111111111111111111111111111111;
    led_board_blue[0] = 0b11111111111111111111111111111111;*/

  // led_board_green[17] = 0b1011001110001111000011111000001111110000001111111000000010101010;
  /*led_board_green[17] = 0b1011001110001111000011111000001111110000001111111000000010101010;
  led_board_red[17] = 0b1010100000011111000000000001101000111110000011111100000111111100;
  led_board_blue[17] = 0b1010100000000001010101100101101110011100011110000111110000011010;*/
  /*
    led_board_green[47] = 0b0101010000000011100000000001101111111111111111111111111111111111;
    led_board_red[47] = 0b1010100000011111000000000001101111111111111111111111111111111111;
    led_board_blue[47] = 0b1111100000000001111111100001101111111111111111111111111111111111;

    led_board_green[17] = 0b0101010000000011100000000001101111111111111111111111111111111111;
    led_board_red[17] = 0b1010100000011111000000000001101111111111111111111111111111111111;
    led_board_blue[17] = 0b1010100000000001010101100101101111111111111111100001111111111111;*/
  for (int j = 0; j < 64; j++) {
    led_board_green[j + 64] = led_board_red[j];
    led_board_blue[j + 64] = led_board_green[j];
    led_board_red[j + 64] = led_board_blue[j];
  }
}

void led_display_draw_single_pixel(uint8_t column, uint8_t row, uint8_t r, uint8_t g, uint8_t b) {

  if (r > 0)
    led_board_red[row] |= (1 << column);
  else
    led_board_red[row] &= ~(1 << column);

  if (g > 0)
    led_board_green[row] |= (1 << column);
  else
    led_board_green[row] &= ~(1 << column);

  if (b > 0)
    led_board_blue[row] |= (1 << column);
  else
    led_board_blue[row] &= ~(1 << column);
}

void board_draw_single_pixel(uint8_t column, uint8_t row, uint8_t r, uint8_t g, uint8_t b) {

  if (row > 23 || column > 10) // Don't draw something out of bounds
    return;

  if (r > 0)
    game_board_red[row] |= (1 << column);
  else
    game_board_red[row] &= ~(1 << column);

  if (g > 0)
    game_board_green[row] |= (1 << column);
  else
    game_board_green[row] &= ~(1 << column);

  if (b > 0)
    game_board_blue[row] |= (1 << column);
  else
    game_board_blue[row] &= ~(1 << column);
}

void game_draw_game_board(uint8_t display_score_param) {

  static uint8_t display_score = 0;
  if (display_score_param == 1)
    display_score = display_score_param;
  else if (display_score_param == 2)
    display_score = 0;

  for (int i = 0; i < 25; i++) {
    if (i != 0) {
      led_board_red[i] &= ~(0x3FF << 21);
      led_board_red[i] |= (game_board_red[i - 1] << 21);
      led_board_blue[i] &= ~(0x3FF << 21);
      led_board_blue[i] |= (game_board_blue[i - 1] << 21);
      led_board_green[i] &= ~(0x3FF << 21);
      led_board_green[i] |= (game_board_green[i - 1] << 21);
    }
    if (display_score) {
      if (i < 5) {
        led_board_blue[i + 27] &= ~(0xFFFFFF);
        led_board_blue[i + 27] |= (game_score_board[i]);
      }
    }
    if (i == 1) {
      led_board_blue[i + 4] &= ~(0x1FFFF << 1);
      led_board_blue[i + 3] &= ~(0x1FFFF << 1);
      led_board_blue[i + 2] &= ~(0x1FFFF << 1);
      led_board_blue[i + 1] &= ~(0x1FFFF << 1);
      led_board_blue[i] &= ~(0x1FFFF << 1);

      led_board_blue[i + 4] |= (game_score_timer[4] << 1);
      led_board_blue[i + 3] |= (game_score_timer[3] << 1);
      led_board_blue[i + 2] |= (game_score_timer[2] << 1);
      led_board_blue[i + 1] |= (game_score_timer[1] << 1);
      led_board_blue[i] |= (game_score_timer[0] << 1);
    }
    if (i == 22) {
      led_board_blue[i] &= ~(0xF0F << 6);
      led_board_blue[i + 1] &= ~(0xF0F << 6);
      led_board_red[i] &= ~(0xF0F << 6);
      led_board_red[i + 1] &= ~(0xF0F << 6);
      led_board_green[i] &= ~(0xF0F << 6);
      led_board_green[i + 1] &= ~(0xF0F << 6);
      led_board_blue[i] |= (game_next_pieces_blue[0] << 14);
      led_board_blue[i + 1] |= (game_next_pieces_blue[1] << 14);
      led_board_green[i] |= (game_next_pieces_green[0] << 14);
      led_board_green[i + 1] |= (game_next_pieces_green[1] << 14);
      led_board_red[i] |= (game_next_pieces_red[0] << 14);
      led_board_red[i + 1] |= (game_next_pieces_red[1] << 14);

      led_board_blue[i + 1 - 6] &= ~(0xF << 14);
      led_board_blue[i + 2 - 6] &= ~(0xF << 14);
      led_board_red[i + 1 - 6] &= ~(0xF << 14);
      led_board_red[i + 2 - 6] &= ~(0xF << 14);
      led_board_green[i + 1 - 6] &= ~(0xF << 14);
      led_board_green[i + 2 - 6] &= ~(0xF << 14);
      led_board_blue[i + 1 - 6] |= (game_next_pieces_blue[2] << 14);
      led_board_blue[i + 2 - 6] |= (game_next_pieces_blue[3] << 14);
      led_board_green[i + 1 - 6] |= (game_next_pieces_green[2] << 14);
      led_board_green[i + 2 - 6] |= (game_next_pieces_green[3] << 14);
      led_board_red[i + 1 - 6] |= (game_next_pieces_red[2] << 14);
      led_board_red[i + 2 - 6] |= (game_next_pieces_red[3] << 14);

      led_board_blue[i + 1 - 11] &= ~(0xF << 14);
      led_board_blue[i + 2 - 11] &= ~(0xF << 14);
      led_board_red[i + 1 - 11] &= ~(0xF << 14);
      led_board_red[i + 2 - 11] &= ~(0xF << 14);
      led_board_green[i + 1 - 11] &= ~(0xF << 14);
      led_board_green[i + 2 - 11] &= ~(0xF << 14);
      led_board_blue[i + 1 - 11] |= (game_next_pieces_blue[4] << 14);
      led_board_blue[i + 2 - 11] |= (game_next_pieces_blue[5] << 14);
      led_board_green[i + 1 - 11] |= (game_next_pieces_green[4] << 14);
      led_board_green[i + 2 - 11] |= (game_next_pieces_green[5] << 14);
      led_board_red[i + 1 - 11] |= (game_next_pieces_red[4] << 14);
      led_board_red[i + 2 - 11] |= (game_next_pieces_red[5] << 14);

