tirth-pandya/son_of_a_gun_game/projects/lpc40xx_freertos/l5_application/led_display_driver.c
      led_board_blue[i] |= (game_save_pieces_blue[0] << 6);
      led_board_blue[i + 1] |= (game_save_pieces_blue[1] << 6);
      led_board_green[i] |= (game_save_pieces_green[0] << 6);
      led_board_green[i + 1] |= (game_save_pieces_green[1] << 6);
      led_board_red[i] |= (game_save_pieces_red[0] << 6);
      led_board_red[i + 1] |= (game_save_pieces_red[1] << 6);
    }
  }
}

void game_title_change(uint32_t position, uint32_t display_type) {
  uint32_t r31 = 0;
  uint32_t r30 = 0;
  uint32_t r29 = 0;
  uint32_t r28 = 0;
  uint32_t r27 = 0;

  if (display_type == 1) {
    r31 = game_score_board[4];
    r30 = game_score_board[3];
    r29 = game_score_board[2];
    r28 = game_score_board[1];
    r27 = game_score_board[0];
    if (position == 0)
      game_draw_game_board(1);
  } else {
    r31 = 0b1111101110111110111001110011110;
    r30 = 0b0010001000001000100100100100000;
    r29 = 0b0010001100001000111000100011100;
    r28 = 0b0010001000001000101000100000010;
    r27 = 0b0010001110001000100101110111100;
    game_draw_game_board(2);
  }
  led_board_blue[31] &= ~(7 << position);
  led_board_blue[31] |= r31 & (7 << position);
  led_board_green[31] = 0;
  led_board_green[31] |= r31 & (7 << position);

  led_board_blue[30] &= ~(7 << position);
  led_board_blue[30] |= r30 & (7 << position);
  led_board_green[30] = 0;
  led_board_green[30] |= r30 & (7 << position);

  led_board_blue[29] &= ~(7 << position);
  led_board_blue[29] |= r29 & (7 << position);
  led_board_green[29] = 0;
  led_board_green[29] |= r29 & (7 << position);

  led_board_blue[28] &= ~(7 << position);
  led_board_blue[28] |= r28 & (7 << position);
  led_board_green[28] = 0;
  led_board_green[28] |= r28 & (7 << position);

  led_board_blue[27] &= ~(7 << position);
  led_board_blue[27] |= r27 & (7 << position);
  led_board_green[27] = 0;
  led_board_green[27] |= r27 & (7 << position);
}

void game_board_score_draw(int number) {

  game_score_board[4] = 0;
  game_score_board[3] = 0;
  game_score_board[2] = 0;
  game_score_board[1] = 0;
  game_score_board[0] = 0;

  int temp = 0;

  if (number > 999999)
    number = 999999;
  {
    // First digit
    for (int i = 0; i < 8; i++) {
      if (i == 0) {
        temp = number % (10);
      } else if (i == 1) {
        if (number > 9)
          temp = (number % 100) / (10);
        else
          temp = 0;
      } else if (i == 2) {
        if (number > 99)
          temp = (number % 1000) / (100);
        else
          temp = 0;
      } else if (i == 3) {
        if (number > 999)
          temp = (number % 10000) / (1000);
        else
          temp = 0;
      } else if (i == 4) {
        if (number > 9999)
          temp = (number % 100000) / (10000);
        else
          temp = 0;
      } else if (i == 5) {
        if (number > 99999)
          temp = (number % 1000000) / (100000);
        else
          temp = 0;
      } else if (i == 6) {
        if (number > 999999)
          temp = (number % 10000000) / (1000000);
        else
          temp = 0;
      }

      if (temp == 0) {
        game_score_board[4] |= (0b111 << ((4 * i)));
        game_score_board[3] |= (0b101 << ((4 * i)));
        game_score_board[2] |= (0b101 << ((4 * i)));
        game_score_board[1] |= (0b101 << ((4 * i)));
        game_score_board[0] |= (0b111 << ((4 * i)));
      } else if (temp == 1) {
        game_score_board[4] |= (0b001 << ((4 * i)));
        game_score_board[3] |= (0b001 << ((4 * i)));
        game_score_board[2] |= (0b001 << ((4 * i)));
        game_score_board[1] |= (0b001 << ((4 * i)));
        game_score_board[0] |= (0b001 << ((4 * i)));
      } else if (temp == 2) {
        game_score_board[4] |= (0b111 << ((4 * i)));
        game_score_board[3] |= (0b001 << ((4 * i)));
        game_score_board[2] |= (0b111 << ((4 * i)));
        game_score_board[1] |= (0b100 << ((4 * i)));
        game_score_board[0] |= (0b111 << ((4 * i)));
      } else if (temp == 3) {
        game_score_board[4] |= (0b111 << ((4 * i)));
        game_score_board[3] |= (0b001 << ((4 * i)));
        game_score_board[2] |= (0b111 << ((4 * i)));
        game_score_board[1] |= (0b001 << ((4 * i)));
        game_score_board[0] |= (0b111 << ((4 * i)));
      } else if (temp == 4) {
        game_score_board[4] |= (0b101 << ((4 * i)));
        game_score_board[3] |= (0b101 << ((4 * i)));
        game_score_board[2] |= (0b111 << ((4 * i)));
        game_score_board[1] |= (0b001 << ((4 * i)));
        game_score_board[0] |= (0b001 << ((4 * i)));
      } else if (temp == 5) {
        game_score_board[4] |= (0b111 << ((4 * i)));
        game_score_board[3] |= (0b100 << ((4 * i)));
        game_score_board[2] |= (0b110 << ((4 * i)));
        game_score_board[1] |= (0b001 << ((4 * i)));
        game_score_board[0] |= (0b110 << ((4 * i)));
      } else if (temp == 6) {
        game_score_board[4] |= (0b111 << ((4 * i)));
        game_score_board[3] |= (0b100 << ((4 * i)));
        game_score_board[2] |= (0b111 << ((4 * i)));
        game_score_board[1] |= (0b101 << ((4 * i)));
        game_score_board[0] |= (0b111 << ((4 * i)));
      } else if (temp == 7) {
        game_score_board[4] |= (0b111 << ((4 * i)));
        game_score_board[3] |= (0b001 << ((4 * i)));
        game_score_board[2] |= (0b001 << ((4 * i)));
        game_score_board[1] |= (0b001 << ((4 * i)));
        game_score_board[0] |= (0b001 << ((4 * i)));
      } else if (temp == 8) {
        game_score_board[4] |= (0b111 << ((4 * i)));
        game_score_board[3] |= (0b101 << ((4 * i)));
        game_score_board[2] |= (0b111 << ((4 * i)));
        game_score_board[1] |= (0b101 << ((4 * i)));
        game_score_board[0] |= (0b111 << ((4 * i)));
      } else if (temp == 9) {
        game_score_board[4] |= (0b111 << ((4 * i)));
        game_score_board[3] |= (0b101 << ((4 * i)));
        game_score_board[2] |= (0b111 << ((4 * i)));
        game_score_board[1] |= (0b001 << ((4 * i)));
        game_score_board[0] |= (0b001 << ((4 * i)));
      }
    }
  }
}

void game_board_next_piece(uint8_t piece, uint8_t position) {

