tirth-pandya/son_of_a_gun_game/projects/lpc40xx_freertos/l5_application/led_display_driver.c
  if (piece == 1) {
    game_next_pieces_blue[1 + (2 * position)] = 0b0100;
    game_next_pieces_blue[0 + (2 * position)] = 0b0111;
    game_next_pieces_red[1 + (2 * position)] = 0;
    game_next_pieces_red[0 + (2 * position)] = 0;
    game_next_pieces_green[1 + (2 * position)] = 0;
    game_next_pieces_green[0 + (2 * position)] = 0;
  } else if (piece == 2) {
    game_next_pieces_blue[1 + (2 * position)] = 0;
    game_next_pieces_blue[0 + (2 * position)] = 0;
    game_next_pieces_red[1 + (2 * position)] = 0;
    game_next_pieces_red[0 + (2 * position)] = 0;
    game_next_pieces_green[1 + (2 * position)] = 0b0011;
    game_next_pieces_green[0 + (2 * position)] = 0b0110;
  } else if (piece == 3) {
    game_next_pieces_blue[1 + (2 * position)] = 0;
    game_next_pieces_blue[0 + (2 * position)] = 0xF;
    game_next_pieces_red[1 + (2 * position)] = 0;
    game_next_pieces_red[0 + (2 * position)] = 0;
    game_next_pieces_green[1 + (2 * position)] = 0;
    game_next_pieces_green[0 + (2 * position)] = 0xF;
  } else if (piece == 4) {
    game_next_pieces_blue[1 + (2 * position)] = 0;
    game_next_pieces_blue[0 + (2 * position)] = 0;
    game_next_pieces_red[1 + (2 * position)] = 0b0110;
    game_next_pieces_red[0 + (2 * position)] = 0b0011;
    game_next_pieces_green[1 + (2 * position)] = 0;
    game_next_pieces_green[0 + (2 * position)] = 0;
  } else if (piece == 5) {
    game_next_pieces_blue[1 + (2 * position)] = 0b0010;
    game_next_pieces_blue[0 + (2 * position)] = 0b0111;
    game_next_pieces_red[1 + (2 * position)] = 0b0010;
    game_next_pieces_red[0 + (2 * position)] = 0b0111;
    game_next_pieces_green[1 + (2 * position)] = 0;
    game_next_pieces_green[0 + (2 * position)] = 0;
  } else if (piece == 6) {
    game_next_pieces_blue[1 + (2 * position)] = 0b0000;
    game_next_pieces_blue[0 + (2 * position)] = 0b0000;
    game_next_pieces_red[1 + (2 * position)] = 0b0110;
    game_next_pieces_red[0 + (2 * position)] = 0b0110;
    game_next_pieces_green[1 + (2 * position)] = 0b0110;
    game_next_pieces_green[0 + (2 * position)] = 0b0110;
  } else if (piece == 7) {
    game_next_pieces_blue[1 + (2 * position)] = 0b0001;
    game_next_pieces_blue[0 + (2 * position)] = 0b0111;
    game_next_pieces_red[1 + (2 * position)] = 0b0001;
    game_next_pieces_red[0 + (2 * position)] = 0b0111;
    game_next_pieces_green[1 + (2 * position)] = 0b0001;
    game_next_pieces_green[0 + (2 * position)] = 0b0111;
  }
}

void game_board_timer(int seconds) {

  game_score_timer[4] = 0;
  game_score_timer[3] = 0;
  game_score_timer[2] = 0;
  game_score_timer[1] = 0;
  game_score_timer[0] = 0;

  int temp = 0;
  int calculated_digit = 0;

  int digit_positions[4] = {0};

  // Timer - 00 : 00
  // [3][2] : [1][0]
  calculated_digit = seconds;
  calculated_digit = calculated_digit % 60;
  calculated_digit %= 10;
  digit_positions[0] = calculated_digit;

  calculated_digit = seconds;
  calculated_digit = ((calculated_digit % 60) / 10) % 10;
  digit_positions[1] = calculated_digit;

  calculated_digit = seconds;
  calculated_digit = (calculated_digit / 60) % 10;
  digit_positions[2] = calculated_digit;

  calculated_digit = seconds;
  calculated_digit = ((calculated_digit / 60) / 10) % 10;
  digit_positions[3] = calculated_digit;

  for (int i = 0; i < 4; i++) {

    temp = digit_positions[i];

    if (temp == 0) {
      game_score_timer[4] |= (0b111 << ((4 * i)));
      game_score_timer[3] |= (0b101 << ((4 * i)));
      game_score_timer[2] |= (0b101 << ((4 * i)));
      game_score_timer[1] |= (0b101 << ((4 * i)));
      game_score_timer[0] |= (0b111 << ((4 * i)));
    } else if (temp == 1) {
      game_score_timer[4] |= (0b001 << ((4 * i)));
      game_score_timer[3] |= (0b001 << ((4 * i)));
      game_score_timer[2] |= (0b001 << ((4 * i)));
      game_score_timer[1] |= (0b001 << ((4 * i)));
      game_score_timer[0] |= (0b001 << ((4 * i)));
    } else if (temp == 2) {
      game_score_timer[4] |= (0b111 << ((4 * i)));
      game_score_timer[3] |= (0b001 << ((4 * i)));
      game_score_timer[2] |= (0b111 << ((4 * i)));
      game_score_timer[1] |= (0b100 << ((4 * i)));
      game_score_timer[0] |= (0b111 << ((4 * i)));
    } else if (temp == 3) {
      game_score_timer[4] |= (0b111 << ((4 * i)));
      game_score_timer[3] |= (0b001 << ((4 * i)));
      game_score_timer[2] |= (0b111 << ((4 * i)));
      game_score_timer[1] |= (0b001 << ((4 * i)));
      game_score_timer[0] |= (0b111 << ((4 * i)));
    } else if (temp == 4) {
      game_score_timer[4] |= (0b101 << ((4 * i)));
      game_score_timer[3] |= (0b101 << ((4 * i)));
      game_score_timer[2] |= (0b111 << ((4 * i)));
      game_score_timer[1] |= (0b001 << ((4 * i)));
      game_score_timer[0] |= (0b001 << ((4 * i)));
    } else if (temp == 5) {
      game_score_timer[4] |= (0b111 << ((4 * i)));
      game_score_timer[3] |= (0b100 << ((4 * i)));
      game_score_timer[2] |= (0b110 << ((4 * i)));
      game_score_timer[1] |= (0b001 << ((4 * i)));
      game_score_timer[0] |= (0b110 << ((4 * i)));
    } else if (temp == 6) {
      game_score_timer[4] |= (0b111 << ((4 * i)));
      game_score_timer[3] |= (0b100 << ((4 * i)));
      game_score_timer[2] |= (0b111 << ((4 * i)));
      game_score_timer[1] |= (0b101 << ((4 * i)));
      game_score_timer[0] |= (0b111 << ((4 * i)));
    } else if (temp == 7) {
      game_score_timer[4] |= (0b111 << ((4 * i)));
      game_score_timer[3] |= (0b001 << ((4 * i)));
      game_score_timer[2] |= (0b001 << ((4 * i)));
      game_score_timer[1] |= (0b001 << ((4 * i)));
      game_score_timer[0] |= (0b001 << ((4 * i)));
    } else if (temp == 8) {
      game_score_timer[4] |= (0b111 << ((4 * i)));
      game_score_timer[3] |= (0b101 << ((4 * i)));
      game_score_timer[2] |= (0b111 << ((4 * i)));
      game_score_timer[1] |= (0b101 << ((4 * i)));
      game_score_timer[0] |= (0b111 << ((4 * i)));
    } else if (temp == 9) {
      game_score_timer[4] |= (0b111 << ((4 * i)));
      game_score_timer[3] |= (0b101 << ((4 * i)));
      game_score_timer[2] |= (0b111 << ((4 * i)));
      game_score_timer[1] |= (0b001 << ((4 * i)));
      game_score_timer[0] |= (0b001 << ((4 * i)));
    }
  }
}

void game_board_save_piece(uint8_t piece) {
  if (piece == 0) // clear save space
  {
    game_save_pieces_blue[1] = 0;
    game_save_pieces_blue[0] = 0;
    game_save_pieces_red[1] = 0;
    game_save_pieces_red[0] = 0;
    game_save_pieces_green[1] = 0;
    game_save_pieces_green[0] = 0;
  }
  if (piece == 1) // blue ricky
  {
    game_save_pieces_blue[1] = 0b0100;
    game_save_pieces_blue[0] = 0b0111;
    game_save_pieces_red[1] = 0;
    game_save_pieces_red[0] = 0;
    game_save_pieces_green[1] = 0;
    game_save_pieces_green[0] = 0;
  } else if (piece == 2) // cleaveland Z
  {
    game_save_pieces_blue[1] = 0;
    game_save_pieces_blue[0] = 0;
    game_save_pieces_red[1] = 0;
    game_save_pieces_red[0] = 0;
    game_save_pieces_green[1] = 0b0011;
    game_save_pieces_green[0] = 0b0110;
  } else if (piece == 3) // hero
  {
    game_save_pieces_blue[1] = 0;
    game_save_pieces_blue[0] = 0xF;
    game_save_pieces_red[1] = 0;
    game_save_pieces_red[0] = 0;
    game_save_pieces_green[1] = 0;
    game_save_pieces_green[0] = 0xF;
  } else if (piece == 4) // rhode_z
  {
    game_save_pieces_blue[1] = 0;
    game_save_pieces_blue[0] = 0;
    game_save_pieces_red[1] = 0b1100;
    game_save_pieces_red[0] = 0b0110;
    game_save_pieces_green[1] = 0;
    game_save_pieces_green[0] = 0;
  } else if (piece == 5) // teewee
  {
    game_save_pieces_blue[1] = 0b0010;
    game_save_pieces_blue[0] = 0b0111;
    game_save_pieces_red[1] = 0b0010;
    game_save_pieces_red[0] = 0b0111;
    game_save_pieces_green[1] = 0;
    game_save_pieces_green[0] = 0;
  } else if (piece == 6) // smashboy
  {
    game_save_pieces_blue[1] = 0;
    game_save_pieces_blue[0] = 0;
    game_save_pieces_red[1] = 0b0110;
    game_save_pieces_red[0] = 0b0110;
    game_save_pieces_green[1] = 0b0110;
    game_save_pieces_green[0] = 0b0110;
  } else if (piece == 7) // white ricky
  {
    game_save_pieces_blue[1] = 0b0001;
    game_save_pieces_blue[0] = 0b0111;
    game_save_pieces_red[1] = 0b0001;
    game_save_pieces_red[0] = 0b0111;
    game_save_pieces_green[1] = 0b0001;
    game_save_pieces_green[0] = 0b0111;
  }
}